var fetishname = ["Автомобиль","Жвачка","Джинсы","Колбаса","Пластинки","Французские духи"]

var fetishdesc = ["Личный автомобиль был мечтой любого советского человека. Хотя в СССР  легковые автомобили выпускали ГАЗ («Волга»), завод в Тольятти («Жигули») и АЗЛК («Москвич»), просто так машину было приобрести нельзя. Заводы СССР не могли удовлетворить спрос населения, к тому же автомобили были предметом экспорта и продавались как в развивающихся, так и в капиталистических странах Европы. Так, например, на экспорт шло более 50% автомашин «Москвич», которых в СССР  выпускалось более 100 тыс. в год — капля в море для страны с населением в 140 млн человек. В 1978 году Советский Союз экспортировал почти 400 тыс. легковых автомобилей — из них 285 тыс. вазовских. Приоритетом было получение валюты, а не «деревянных» рублей с внутреннего рынка. Потому-то, вероятно, помимо всего прочего приобретение автомашины было не по карману многим гражданам: при средней годовой зарплате в 2 тыс. руб. на автомобиль «Жигули» стоимостью 8 тыс. копить приходилось годами («Волга» стоила аж 16 тыс. руб.). Даже накопив или заработав за границей или «на северах» на машину, за ней все равно надо было встать в очередь и после нескольких лет ожидания получить по почте открытку на приобретение автомобиля в специализированном магазине. В связи с этим машины нередко становились предметом спекуляций: их активно продавали в значительно более богатые южные республики СССР, такие как Грузия и Армения, где обладание черной «Волгой» было вопросом социального статуса.",
    "Жвачка, она же «бубле-гум», как нарочито неправильно называли ее в СССР фарцовщики, была еще одним вожделенным предметом обладания. Скорее дело было не в самой жвачке, а в стиле жизни подсмотренных американских фильмов, где жвачку жевали все поголовно «крутые парни». Жвачка была едва ли не главным предметом «культурного обмена» с иностранцами, в том числе и из соцстран. Отношение к жвачке, прежде презираемой официальной пропагандой (использующих жвачку сравнивали с жвачными животными), изменилось после рекомендаций Министерства здравоохранения наладить изготовление этого продукта в стране в связи с полезностью его для укрепления зубов и очищения полости рта. Первыми жевательную резинку стали выпускать в «продвинутой» Эстонской ССР — когда, как писал в научной работе «Резервы повышения эффективности производства в пищевой промышленности: из опыта Э­ССР» Яан Тепанды, «сомнения органов здравоохранения были рассеяны».<br>В середине 1970-х годов жевательную резинку стали производить на кондитерской фабрике «Рот-Фронт» в Москве. Это были «Кофейный Аромат», «Мятная» и «Клубничная», однако они не слишком котировались, так как из них нельзя было выдувать вожделенные пузыри и вкус у них был слишком «ломовой». Выпускаемые в СССР пластинки относились именно к классу chewing gum, а не bubble gum. Самой распространенной из привозных в Стране Советов была жевательная резинка из Чехословакии, а также болгарская жвачка «Идеал». Иностранную жвачку берегли для особых случаев — например, свидания с девушкой, а потерявшую вкус иногда даже клали в сахар, когда он еще был не в дефиците. Обертку от жвачки долго хранили, время от времени извлекая на свет, чтобы вдохнуть заветный запах или похвастаться знакомым.",
    "«Джинсовая волна до СССР доходит с опозданием, зато накрывает с головой», — писал в одной из своих книг проекта «Намедни» телеведущий и публицист Леонид Парфенов, который отмечает, что массовой популярностью джинсы начинают пользоваться в середине 70-х, хотя в свободной продаже их не было. Джинсы иностранного производства в СССР были дефицитом из дефицитов. Их привозили, а чаще всего доставали у фарцовщиков, которые покупали джинсы у «фирмачей», иностранцев или моряков, возвращавшихся из заграничного плавания, — при этом ввоз джинсов был ограничен: нельзя было привозить больше двух пар из-за опасения обвинений в спекуляции. Наиболее культовой маркой считались американские джинсы Montana.<br>Цена на джинсы была достаточно высокой и составляла от 150 до 200 руб. (при средней месячной зарплате в 120–150 руб.). Хотя в теории иностранные джинсы купить в СССР, отстояв очередь, было можно — к услугам страждущих были либо джинсы из ГДР , либо более качественные индийские джинсы Avis, продававшиеся в индийском магазине «Ганга». После начала перестройки, видимо на волне «сближения с Западом», проблему с джинсами на какое-то время удалось решить — они повсеместно появились в продаже по цене 100 руб. и через какое-то время уже не вызывали прежнего ажиотажа. <br>При этом не раз предпринимались попытки наладить производство собственных джинсовых брюк в СССР: делегация советских производственников даже выезжала в США для ознакомления с производством. Для предприятия «Рабочая одежда» было закуплено иностранное оборудование. Однако, как констатировал в 1982 году журнал «Молодой коммунист», спросом изделия не пользовались: «Например, все магазины сейчас завалены совершенно не пользующимися популярностью брюками так называемого «джинсового типа». Полноценными джинсами советские производители свои изделия старались не называть, для этого использовалось выражение «брюки из джинсовой ткани». При этом даже этих изделий не хватало: как отмечало издание «Коммерческий вестник» в 1980 году, «костюмы и брюки из джинсовых тканей повышенной жесткости типа «Орбита» составляют незначительный удельный вес в общем объеме производства этих изделий». Злополучная ткань «Орбита» Куровского комбината из Московской области дожила почти до конца СССР, хотя более-менее приличные джинсы уже освоили отечественные кооператоры из привезенной из Польши джинсовой ткани. С момента начала ее выпуска прошло уже более двадцати лет, а критика была все той же: «Она непривлекательна... И что бы мы из нее ни шили — брюки, рабочие комбинезоны, большим спросом это не пользуется. Проблемы с тканями... Так и хочется спросить у руководителей Госкомитета по стандартам СССР: что же это за ГОСТы?!» — задавался вопросом вестник «Известия Советов народных депутатов» в 1989 году. До распада СССР оставалось два года.",
    "Обычный пищевой продукт колбаса стала символом целой экономической эпохи — «колбасными электричками» называли поезда, на которых «за колбасой», равно как и за другими продуктами, ездили в Москву из провинции, а «колбасной эмиграцией» называли тех, кто покидал родину в середине 80-х по прозаическим причинам отсутствия в стране продовольственных товаров. <br>Почему колбаса — скажем, с точки зрения западного потребителя, довольно заурядный продукт — стала своего рода индикатором экономического здоровья СССР? Дело в том, что советская власть в 50–60-е годы усиленно продвигала колбасу в качестве главной составляющей мясного рациона советского человека и пропагандировала ее доступность в качестве показателя роста благосостояния. Колбаса действительно была доступной, дешевой и вкусной. В магазинах продавались десятки сортов вареных и копченых колбас. Однако в начале семидесятых, с наступлением «брежневского торможения», начались серьезные проблемы с животноводческой отраслью. Поголовье скота практически не увеличивалось при одновременном росте населения. «Не было у нас в Советском Союзе мясного животноводства. У нас забивали скотину, которая уже молока не давала» — эти слова Владимира Путина, тогда премьера, вызвали резкое неприятие у фракции КПРФ во время его выступления в Думе, но, в принципе, верно описывали реальность.<br>Столкнувшись с нехваткой мяса, чиновники решили поменять традиционную рецептуру (например, для «Докторской» ГОСТ 30-х годов предписывал тратить на 100 кг колбасы порядка 90 кг мяса, остальное яйца и молоко). В восьмидесятых новые «рецепты» уже допускали использование при производстве колбасы муки, крахмала, сухого молока, яичного порошка и т.д. Но подход «кидай все, что под руку подвернется» не помог. Очереди за мясом и колбасой появились еще тогда, когда Леонид Ильич мог выступать «без бумажки». Речь шла о самой обычной отварной колбасе, такой, какую ест мультяшный кот Матроскин. О сервелате, который любила продвинутая интеллигенция, говорить не приходится, его в СССР практически не производили и поэтому большим спросом пользовался сервелат венгерский, его давали в заказах особо ценным работникам.<br>Отсутствие колбасы и резкое снижение ее качества были четким сигналом для ранее подсаженного на эту самую колбасу населения: прогнило что-то в датском государстве (то бишь в советском). Если перечитать СМИ тех лет, можно заметить, что колбасная тема — одна из ключевых, волнующих советского человека. После одной из публикаций в сатирическом журнале «Крокодил» (1989 год) под звонким названием «Накол-басили!» журнал опубликовал письмо жителя города Воронежа А. Михеенкова, убежденного, что для улучшения качества колбасы «пора вводить телесные наказания» и показывать их по телевизору.",
    "Пластинки популярных иностранных рок-групп, а в просторечии — «пласты», в СССР было не достать в свободной продаже, что объяснялось разными причинами. Во-первых, западный рок, а также большая часть популярной музыки находились в СССР под полузапретом, а единственная в стране фирма грамзаписи «Мелодия» выпускала лишь тех иностранных звезд, которые не наносили своим творчеством «пощечину общественному вкусу». Среди них, например, группа «Бони М», американская певица Дайана Росс или французский певец Джо Дассен. Правда, и эти пластинки не всегда было легко достать, как, кстати, и выпускавшиеся крайне небольшим тиражом пластинки популярных авторов-исполнителей Владимира Высоцкого и Булата Окуджавы. Как правило, пластинки этих бардов продавали в конвертах с какими-нибудь лесными пейзажами, чтобы не очень бросались в глаза и не покупали «кто не надо».<br>Что же касается иностранных рок- или поп-музыкантов, более популярных среди тогдашней молодежи, то их пластинки привозились из-за границы – либо из относительно вольных соцстран, таких как Венгрия или Чехословакия, или же капиталистических, как Западная Германия. Пластинки приобретались за границей во время командировок, везлись дипломатами, продавались на толкучке и были активным предметом для спекуляций. «Сроки наказания за изготовление и спекуляцию пластинками, к сожалению, небольшие», — сетовал автор одного из пособий для будущих следователей. В одном из интервью в журнале «Смена» писатель и публицист Александр Кабаков рассказывал, что формально забирали не за то, что именно купил какую-либо модную пластинку, а за то, что участвовал в акте спекуляции. <br>Помощь в поимке оказывали оперативно-комсомольские отряды, которые выявляли торговцев пластинками и сообщали об этом в милицию. Стоимость купленных у спекулянтов дисков варьировалась от 10 до 70 руб. при стоимости обычной пластинки от 1 рубля до 3. Кстати, не все предлагали действовать лишь запретительными методами. «Именно широкое распространение дискотек могло бы служить средством борьбы со спекуляцией пластинками и магнитофонными записями, которая, к сожалению, еще бытует в студенческой среде», — писал в 1981 году советский социолог Владимир Лисовский в брошюре «Образ жизни современного студента». Пластинки с записями западных рок-групп изымались таможней СССР даже во время перестройки — и это когда уже из подполья вышел рок, а западные звезды стали приезжать в Россию. «Так, только на КПП таможни города Минска ежегодно перехватывается свыше 1000 пластинок ансамблей «КПСС»... Сложно даже перечислить все те ухищрения, на которые пускаются западные рок-диверсанты... Так, например, на одном из альбомов группы «Моторхэд» изображена бутылка водки с надписью: «Водка Смирновская»!» — писал в 1988 году консервативный журнал «Наш современник». Кстати, из СССР пластинки за границу тоже везли, и были это не только ценимые на Западе записи русских композиторов-классиков, а даже пластинка Пола Маккартни «Снова в СССР» — она была выпущена по контракту фирмой «Мелодия» в 1988 году специально для советского слушателя и сразу стала редкостью.",
    "«Московская фабрика «Новая Заря» — одно из крупнейших предприятий Советского Союза по выпуску парфюмерной продукции… русская парфюмерия имеет много общего с французской, а в некоторых случаях даже превосходит ее», — писал в 1961 году журнал «Внешняя торговля», однако многие дамы в СССР с этим не согласились бы. Советская парфюмерная промышленность действительно иногда выпускала неплохие духи, которые брали призы на международных выставках, однако даже лучшие советские духи «Красная Москва» имели французское происхождение. Поэтому именно французские духи в СССР были предметом настоящего культа и когда появлялись в магазинах, обычно лишь в крупных столичных универмагах вроде ГУМа или ЦУМа, то исчезали в мгновение ока. Первое появление французских духов в продаже в СССР связано с 1960-ми годами, когда из-за особого политического статуса Франции в мире во времена правления Шарля де Голля началось сближение Советского Союза и Франции. Большого выбора у советских модниц не было: названий раз-два и обчелся: «Магриф», «Мажи Нуар», «Клима». Тех же, кому не доставалось французского, могли довольствоваться польскими «Бич може» («Быть может»), которые журналист Леонид Парфенов называл «соцзаменой французских духов». Среди тех духов, которые продавались в СССР, наиболее известными были духи «Клима» — они стоили 25 руб. — четверть зарплаты советского инженера. Когда крохотный флакончик попадал в руки спекулянта, цена взмывала вверх: «К восьмидесятым в народ стал проникать французский парфюм, и там уже цены были любые... Дефицит. Очереди. Спекулянты. Семьдесят. Сто. Двести», — писал в одном из своих романов писатель Михаил Веллер.<br>Единственное, когда можно было не сомневаться, — в случае, если духи были куплены не на толкучке на «Малой Арнаутской улице», а у своих спекулянтов — они были настоящими. В 1990-е, когда на рынок хлынули поддельные товары известных фирм, с лотков стали продавать и сомнительного вида духи «Пуазон» и «Шанель №5», которые, как говаривали шутники, действительно «пахли шинелью»."
]

var gadname = ["«Электроника ВМ-12»","Двухкассетная магнитола","Аудиокассеты","«Зенит-TTL»","Электронные игры"]

var gaddesc = [
    "«Электроника ВМ-12» – первый советский кассетный видеомагнитофон формата VHS, был скопирован с видеомагнитофона Panasonic NV-2000. Начала выпускаться «Электроника» в 1984 году. Отличительной особенностью «ВМ-12» были отсутствие пульта ДУ и вертикальная загрузка кассеты.<br>Первый советский видеомагнитофон обладал массой недостатков: был капризен, регулярно заминал пленку, стоил запредельно дорого — 1200 руб. при средней зарплате в СССР в 1984 году 170 руб. в месяц. <br>Однако все это не помешало ему стать страшно дефицитным и престижным «девайсом». Альтернатив у него не было. Японский Sony или Panasonic стоили как автомобиль или однокомнатная кооперативная квартира.<br>Купить «ВМ-12» можно было по предзаказу. Сам процесс немного напоминал приобретение в октябре 2014 года iPhone 6 64 ГБ цвета «серый космос». Но ждать нужно было не две-три недели, а несколько месяцев, либо приобретать его у барыг по завышенной цене. И очереди были живые, а не электронные.<br>Видеомагнитофон мог записывать телепрограммы, но собственно эта функция мало кого интересовала, главное — это возможность проигрывать видеокассеты с запрещенными в CCCР фильмами. Во многом благодаря «ВМ-12» в Советском Союзесформировалась любовь к голливудскому кинематографу.<br>Очень популярны были фильмы на тему вьетнамской войны: «Взвод» и «Рожденный четвертого июля» Оливера Стоуна, «Апокалипсис сегодня» Френсиса Ф. Копполы, «Цельнометаллическая оболочка» Стенли Кубрика, «Охотник на оленей» Майкла Чимино. Боевики со Шварценеггером, Сталлоне и Брюсом Ли также весьма котировались. Разумеется, хитами были и эротические фильмы а-ля «Греческая смоковница», а также разнообразные ужастики.",
    "Если «Электроника ВМ-12» была относительно элитарным гаджетом, к которому должен был прилагаться как минимум цветной телевизор, то двухкассетный японский магнитофон, как правило SHARP, являлся мечтой каждого молодого человека. В Советском Союзе именно двухкассетники этой компании пользовались безумной популярностью. «Шарпы» в СССР привозили военные, моряки, пилоты гражданской авиации, дипломаты и другие специалисты, имеющие возможность выезда за рубеж.<br>Стоили двухкассетники от $170 за Sharp GF-450 H до $600 за знаменитый Sharp GF 777 Z, при официальном курсе 0,67 руб. за $1. Продавались они фарцовщиками и в комиссионках исходя из курса 3–4 руб. за $1.<br>Напомним, что в СССР валюту по официальном курсу можно было приобрести только в ограниченном количестве ($200) при выезде за рубеж, а спекуляция валютой наказывалась по статье 88 Уголовного кодекса РСФСР 1960 года «Нарушение правил о валютных операциях» и предполагала в зависимости от состава преступление лишение свободы на срок от 3 до 15 лет, конфискацию имущества, ссылку на срок до 5 лет и СМЕРТНУЮ КАЗНЬ.<br>Отметим, что если высококачественные катушечные магнитофоны советская промышленность еще производила («Электроника-003», «-004», «Олимп-004», «005»), то аналогов японских двухкассетников в СССР просто не производили.<br>Sharp GF-777 Z был топовой моделью линейки переносных стереомагнитол начала восьмидесятых. GF-777 Z выполнен в классическом форм-факторе «моноблок», а главное его отличие от однокассетных моделей — смещенные влево две кассетные деки. Магнитола оснащалась шестью громкоговорителями (!): двумя высокочастотными «пищалками», двумя 6,5-дюймовыми широкополосными динамиками и двумя 6,5-дюймовыми низкочастотниками. GF-777 имел четыре усилителя мощности, обеспечивавших раздельное усиление частот, что давало великолепный звук и солидную громкость.<br>Пиковая мощность (PMPO) аппарата составляла 90 Вт, а номинальная (RMS) — 24 Вт. Этого было достаточно для любой вечеринки. Более того, таким аппаратом можно было озвучить даже школьную дискотеку.<br>В Sharp GF-777 устанавливался всеволновый радиоприемник с диапазонами FM, AM и двумя диапазонами коротких волн (SW). За хороший коротковолновый приемник GF-777 ценили любители послушать «вражеские голоса» в диапазоне 13 и 16 метров, где не работали советские «глушилки» (приемников с такими диапазонами у населения было очень мало).",
    "С распространением кассетной аудиотехники дефицит охватил и то, что называется расходными материалами.<br>Советская промышленность производила аудиокассеты МК-60. Стоили они 4 руб., а отличительной их особенностью было посредственное качество и очень неудобный часовой формат (по 30 минут с каждой стороны).<br>Дело в том, что почти все музыкальные альбомы были длительностью 40–45 минут. То есть после записи такого альбома оставался 15-минутный «хвост», который «добивали» разными песнями, чтобы не пропадало драгоценное место. Соответственно, огромной популярностью у владельцев кассетных магнитофонов пользовались удобные импортные 90-минутные кассеты, которые были и заметно более высокого качества.<br>К счастью для всех советских любителей музыки, в начале восьмидесятых СССР закупил огромную партию кассет Sony, Denon, ТDK, BASF, АGFA. Таким образом, на некоторое время дефицит был ликвидирован. Кассеты несколько лет продавались в обычных магазинах электроники по 9 руб. за штуку.<br>Впрочем, наиболее популярные марки, Sony и Denon, выкупались фарцовщиками в первый день завоза в магазин и потом перепродавались уже по 15 руб.",
    "Были у советской промышленности и свои удачи. В частности, знаменитый зеркальный фотоаппарат «Зенит-TTL», разработанный и производившийся на Красногорском механическом заводе (КМЗ).<br>Было выпущено более полутора миллионов таких аппаратов.<br>Главная его особенность — TTL-экспонометр, измеряющий яркость снимаемой сцены непосредственно через объектив.<br>Розничная цена «Зенита-TTL» с объективом «Гелиос-44М» составляла в начале 80-х годов 210 руб.",
    "Еще одной культовой, причем не только у детей, игрушкой была «Ну, погоди!», самая известная и популярная из серии первых советских портативных электронных игр с жидкокристаллическим экраном.<br>Сюжет игры был незамысловат. Четыре курицы, сидящие на насестах, несут яйца, скатывающиеся вниз по четырем лоткам. Управляя Волком (из мультфильма «Ну, погоди!»), который может занимать четыре позиции, требуется наловить как можно больше яиц в корзину. За пойманное яйцо игроку начисляется одно очко. Сначала яйца падают медленно, но постепенно темп игры ускоряется.<br>«Ну, погоди!» является неофициальным (пиратским) клоном Nintendo EG-26 Egg из серии Nintendo Game & Watch. Единственное, что отличало ее от оригинала, это то, что волк со шляпой из оригинальной игры был заменен волком из мультфильма «Ну, погоди!», а петух, выглядывающий из домика, — зайцем.<br>Производилась игрушка с 1984 года. Кроме игры устройство обладало функцией часов и будильника. Розничная цена «Ну, погоди!» составляла 25 руб."
]


var slovar = [
    "Дефицит",
    "Спекулянт-валютчик",
    "Спекулянт-фарцовщик",
    "Ширпотреб",
    "Макулатурные талоны",
    "Талоны",
    "Очередь",
    "Авоська",
    "Отовариваться",
    "Продуктовый набор",
    "Берёзка",
    "Неликвид",
    "Рыбный день",
    "Товар в нагрузку",
    "Комок",
    "Колбасные поезда",
    "Разнарядка (на товары)",
    "Плюшевый десант",
    "Печка",
    "Котлы",
    "Часы",
    "Чуингамщики",
    "Пласты",
    "Из-под прилавка"
];


var slovdesc = [
    "Недостаток каких-либо товаров в продаже, превышение спроса над предложением, характерное для плановой экономики. Также — отдельный дефицитный товар («повезло тебе — достал дефицит»)",
    "Спекулянт, занимающийся незаконными сделками с иностранной валютой, что каралось еще более суровой уголовной статьей, чем товарная спекуляция",
    "Спекулянт вещами, как правило, иностранного производства. Выменивал или покупал их у иностранцев. Мог одновременно быть и валютчиком",
    "Буквально: товары широкого потребления, однако обычно употреблялось в значении «товары низкого качества». В каком-то смысле противоположность дефициту, хотя и ширпотреб мог стать дефицитом",
    "Художественная литература в СССР была товаром повышенного спроса, оттого и она была в дефиците. В 1980-х годах появилась программа: книги в обмен на макулатуру. Появились специальные отделы книжных магазинов, где книги можно было купить только при предъявлении талонов за сданную макулатуру. Выпускались специальные «макулатурные» серии и собрания сочинений классиков, которые в других отделах не продавались",
    "Элемент карточной системы, т.е. системы снабжения, которая обычно вводится, когда товарный дефицит распространяется на товары первой необходимости. Суть системы в том, что определенные товары можно приобрести только при наличии талонов на них. Талоны раз в месяц выдавались по месту прописки, исходя из установленных норм потребления",
    "Хотя само явление очереди нормально, в условиях товарного дефицита оно приобретает совершенно ненормальный масштаб. Очередь может выстраиваться перед магазином задолго до его открытия, очередь может растягиваться на сотни метров. В больших очередях практиковалась система записи (обычно номер записывался шариковой ручкой на ладони). С очередями связаны такие идиомы, как «вас тут не стояло», «в одни руки» (например: «одна бутылка в одни руки», т.е. покупатель не может купить две) и т.д.",
    "Сетчатая сумка, которую в силу ее компактности удобно брать с собой на всякий случай («авось увижу дефицитный товар — сразу куплю»)",
    "Приобретать товары на талоны (купоны, карточки)",
    "Система продажи дефицитных товаров льготным категориям населения (чиновникам, ветеранам, многодетным семьям и т.д.) перед праздниками. Типичный состав набора: батон сырокопченой колбасы, консервы (красная икра, печень трески, кальмары), бутылка шампанского, зефир в шоколаде и т.п.",
    "Сеть валютно-чековых магазинов, реализовывавших высококачественные продукты и товары, в т.ч. зарубежного производства, за иностранную валюту (иностранцам), либо за чеки Внешторгбанка и Внешпосылторга (советским гражданам)",
    "Наихудшая часть ширпотреба, товары, которые совсем не пользовались спросом из-за их низкого качества. Их могли продавать «в нагрузку» к более востребованным товарам",
    "День недели (четверг), когда в большинстве пунктов общественного питания предлагалось рыбное меню, а мясные продукты отсутствовали. Еженедельные рыбные дни были введены (с 1932 года по инициативе А. Микояна) из-за хронического дефицита мяса, с целью восполнения нехватки белков в рационе советских граждан",
    "Дополнительный товар (как правило, не пользующийся спросом), который необходимо было приобрести при покупке некоего относительно дефицитного товара. Например, консервированная морская капуста в нагрузку к шоколадным конфетам",
    "Комиссионный магазин. В них порой можно было приобрести дефицитные товары, в частности импортные",
    "Электрички и поезда дальнего следования, выезжавшие из Москвы и Санкт-Петербурга в последние выходные месяца. Многие их пассажиры ездили в Москву с одной целью — закупиться дефицитными продуктами (в частности, колбасой), которые «выбрасывали» в конце месяца",
    "Распределение товаров в плановом порядке, а также документ, содержащий распоряжение о таком распределении. Т.е. некий товар мог по решению руководства появиться (быть «выброшен») в одном магазине, отсутствуя в других",
    "Междугородние автобусы, паркующиеся у центральных универмагов с той же целью",
    "Кассетная дека",
    "Часы, как правило, «командирские»",
    "Видеомагнитофон",
    "Подростки, выпрашивающие жвачку у гостиниц",
    "Пластинки зарубежных исполнителей",
    "Способ приобретения дефицитного товара по знакомству с продавцом и/или за дополнительную наценку"
];

var isMobile = {
    Android: function () {
        return navigator.userAgent.match(/Android/i);
    },
    BlackBerry: function () {
        return navigator.userAgent.match(/BlackBerry/i);
    },
    iOS: function () {
        return navigator.userAgent.match(/iPhone|iPad|iPod/i);
    },
    Opera: function () {
        return navigator.userAgent.match(/Opera Mini/i);
    },
    Windows: function () {
        return navigator.userAgent.match(/IEMobile/i);
    },
    any: function () {
        return (isMobile.Android() || isMobile.BlackBerry() || isMobile.iOS() || isMobile.Opera() || isMobile.Windows());
    }
};
if (!isMobile.any()) {
    //d3.select('#maincont').attr('id', 'skrollr-body');
    skrollr.init({
        smoothScrolling: true,
        smoothScrollingDuration: 200,
        mobileDeceleration: 0.02
    });

}





var currpic1 = 0;
d3.select("#arr1-1-1").style("opacity","0.5")

d3.select("#arr1-1-1")
    .on("click",function(){
        if(currpic1>0){
            d3.select("#arr1-1-2").style("opacity","1")
            currpic1--;
            var pad = d3.select("#fet1").select(".imgpad");
            var x = parseInt(pad.style("left"));
            x =-currpic1*520;

            pad.transition().duration(400).style("left", x+"px");

            d3.select("#fet1").select(".subheader").text(fetishname[currpic1])
            d3.select("#fet1").select("p").html(fetishdesc[currpic1])

            if(currpic1==0)d3.select("#arr1-1-1").style("opacity","0.5")
        }
    });

d3.select("#arr1-1-2")
    .on("click",function(){
        if(currpic1<5){
            d3.select("#arr1-1-1").style("opacity","1")
            currpic1++;
            var pad = d3.select("#fet1").select(".imgpad");
            var x = parseInt(pad.style("left"));
            x =-520*currpic1;

            pad.transition().duration(400).style("left", x+"px");
            d3.select("#fet1").select(".subheader").text(fetishname[currpic1])
            d3.select("#fet1").select("p").html(fetishdesc[currpic1])

            if(currpic1==5)d3.select("#arr1-1-2").style("opacity","0.5")
        }
    });

d3.select("#fet1").selectAll(".imgpad")
    .on("click",function(){
        if(currpic1<5){
            d3.select("#arr1-1-1").style("opacity","1")
            currpic1++;
            var pad = d3.select("#fet1").select(".imgpad");
            var x = parseInt(pad.style("left"));
            x =-520*currpic1;

            pad.transition().duration(400).style("left", x+"px");
            d3.select("#fet1").select(".subheader").text(fetishname[currpic1])
            d3.select("#fet1").select("p").html(fetishdesc[currpic1])

            if(currpic1==5)d3.select("#arr1-1-2").style("opacity","0.5")
        }
    });




var currpic2 = 0;
d3.select("#arr1-2-1").style("opacity","0.5")
d3.select("#gad1").select(".subheader").text(gadname[currpic2])
d3.select("#gad1").select("p").html(gaddesc[currpic2])


d3.select("#arr1-2-1")
    .on("click",function(){
        if(currpic2>0){
            d3.select("#arr1-2-2").style("opacity","1")
            currpic2--;
            var pad = d3.select("#gad1").select(".imgpad");
            var x = parseInt(pad.style("left"));
            x =-currpic2*520;

            pad.transition().duration(400).style("left", x+"px");

            d3.select("#gad1").select(".subheader").text(gadname[currpic2])
            d3.select("#gad1").select("p").html(gaddesc[currpic2])

            if(currpic2==0)d3.select("#arr1-2-1").style("opacity","0.5")
        }
    });

d3.select("#arr1-2-2")
    .on("click",function(){
        if(currpic2<4){
            d3.select("#arr1-2-1").style("opacity","1")
            currpic2++;
            var pad = d3.select("#gad1").select(".imgpad");
            var x = parseInt(pad.style("left"));
            x =-520*currpic2;

            pad.transition().duration(400).style("left", x+"px");
            d3.select("#gad1").select(".subheader").text(gadname[currpic2])
            d3.select("#gad1").select("p").html(gaddesc[currpic2])

            if(currpic2==4)d3.select("#arr1-2-2").style("opacity","0.5")
        }
    });

d3.select("#gad1").selectAll(".imgpad")
    .on("click",function(){
        if(currpic2<4){
            d3.select("#arr1-2-1").style("opacity","1")
            currpic2++;
            var pad = d3.select("#gad1").select(".imgpad");
            var x = parseInt(pad.style("left"));
            x =-520*currpic2;

            pad.transition().duration(400).style("left", x+"px");
            d3.select("#gad1").select(".subheader").text(gadname[currpic2])
            d3.select("#gad1").select("p").html(gaddesc[currpic2])
            if(currpic2==4)d3.select("#arr1-2-2").style("opacity","0.5")
        }
    });


d3.select("#next1")
    .on("click",function(){
        window.open("index2.html","_self")
    })

d3.select("#next2")
    .on("click",function(){
        window.open("index3.html","_self")
    })
d3.select("#next3")
    .on("click",function(){
        window.open("index4.html","_self")
    })

d3.select("#next4")
    .on("click",function(){
        window.open("index5.html","_self")
    })

d3.select("#prev2")
    .on("click",function(){
        window.open("index.html","_self")
    })

d3.select("#prev3")
    .on("click",function(){
        window.open("index2.html","_self")
    })
d3.select("#prev4")
    .on("click",function(){
        window.open("index3.html","_self")
    })

d3.select("#prev5")
    .on("click",function(){
        window.open("index4.html","_self")
    })







d3.selectAll(".sitem")
    .on("click",function(){
        num = parseInt(d3.select(this).attr("id").substr(2));
        console.log(num);


        d3.select(".sitem2").select(".spodpis").text(slovar[num]);
        d3.select(".sitem2").select(".stext").text(slovdesc[num]);
        var num1 = num+1;
        d3.select(".sitem2").select(".smain").select("img").attr("src","images/1/slovar/slovar"+num1+".png");
        buildIconSet(num);
    })

buildIconSet(0);
function buildIconSet(num){
    console.log("num==="+num)
    var cx = 0;
    var cy = 0;

    var i = 0;
    while(i<24){

        var x = cx*203;
        var y = cy*233;

        d3.select("#si"+i).style("top",y+"px");
        d3.select("#si"+i).style("left",x+"px");
        d3.select("#si"+i).style("visibility","visible")
        if(i==num){
            var ost = num%3;
            console.log(ost)
            switch (ost) {
                case 0:
                    d3.select("#si"+i).style("visibility","hidden");

                    d3.select(".sitem2").style("top",y+"px");
                    d3.select(".sitem2").style("left",x+"px");
                    cx+=2;
                    i++;
                    x = cx*203;
                    y = cy*233;
                    d3.select("#si"+i).style("top",y+"px");
                    d3.select("#si"+i).style("left",x+"px");
                    d3.select("#si"+i).style("visibility","visible")
                    cy++;
                    i++;
                    x = cx*203;
                    y = cy*233;
                    d3.select("#si"+i).style("top",y+"px");
                    d3.select("#si"+i).style("left",x+"px");
                    d3.select("#si"+i).style("visibility","visible")
                    break
                case 1:
                    d3.select("#si"+i).style("visibility","hidden");

                    d3.select(".sitem2").style("top",y+"px");
                    d3.select(".sitem2").style("left",x+"px");
                    cx=0;
                    cy++
                    i++;
                    x = cx*203;
                    y = cy*233;
                    d3.select("#si"+i).style("top",y+"px");
                    d3.select("#si"+i).style("left",x+"px");
                    d3.select("#si"+i).style("visibility","visible")
                    cx=2;
                    break
                case 2:
                    d3.select("#si"+i).style("visibility","hidden");
                    cx--;
                    x = cx*203;
                    y = cy*233;
                    d3.select(".sitem2").style("top",y+"px");
                    d3.select(".sitem2").style("left",x+"px");
                    cx=0;
                    cy++;
                    i--;
                    x = cx*203;
                    y = cy*233;
                    d3.select("#si"+i).style("top",y+"px");
                    d3.select("#si"+i).style("left",x+"px");
                    d3.select("#si"+i).style("visibility","visible");
                    cx=2;
                    i++;

                    break

            }

        }


        cx++;
        if(cx>2){
            cx = 0;
            cy++;
        }
        i++;
    }
}




d3.select(this).on("mousewheel", function(){
    var scrollTop = window.pageYOffset || document.documentElement.scrollTop;

    console.log(scrollTop)
});

d3.selectAll(".menuitem").on("click", function(){
    var num = d3.select(this).attr("id").substr(1);
    console.log(num);
    window.open("index"+num+".html","_self")
});